app/Concerns/Activity/FormTrait.php

    public function addTeachingGroup()
    {
        $count = count(TeachingGroup::get()) + 1;
---
select * from `teaching_groups`