app/Livewire/OrgApp/Student/Edit.php

    public function save()
    {

        $this->validate();

        $this->student->fill([
            'identity_number' => $this->identity_number,
            'full_name' => $this->full_name,
            'birth_date' => $this->birth_date,
            'student_groups_id' => $this->student_groups_id ?: null,
            'enrollment_type' => $this->enrollment_type,
            'gender' => $this->gender,
            'activation' => $this->activation,
            'status_id' => $this->status_id ?: null,
            'parent_phone' => $this->parent_phone,
            'living_parent_id' => $this->living_parent_id ?: null,
            'notes' => $this->notes,
            'updated_by' => Auth::user()->employee->id,
        ]);

        $isDirty = $this->student->isDirty();
        if ($isDirty) {
            $this->student->save();
---
update `students` set `birth_date` = '2014-04-13', `activation` = '0', `updated_by` = 1, `students`.`updated_at` = '2026-04-10 10:05:53' where `id` = 668

    public function surveyquestions()
    {
        return  SurveyQuestion::where('survey_for_section', 120)->orderBy('question_order')->get();
---
select * from `survey_questions` where `survey_for_section` = 120 order by `question_order` asc