app/Livewire/OrgApp/Student/Index.php

select * from `statuses` where `statuses`.`id` in (132)
select * from `student_groups` where `student_groups`.`id` in (1)
select count(*) as aggregate from `students` where `identity_number` = '440511590'
---
    public function students()
    {
        if ($this->readyToLoad) {
            $user = auth()->user();
            return Student::query()->visibleToTeacher($user)
                ->with(['studentGroup', 'status', 'city', 'region'])
                ->withCount('feedbacks')

                ->when($this->searchIdentityNumber !== '', fn($q) => $q->where('identity_number', $this->searchIdentityNumber))
                ->when($this->searchStudentName !== '', fn($q) => $q->where('id', $this->searchStudentName))
                ->when($this->searchStudentGroupName !== '', fn($q) => $q->where('student_groups_id', $this->searchStudentGroupName))
                ->when($this->searchEnrollment !== '', fn($q) => $q->where('enrollment_type', $this->searchEnrollment))
                ->when($this->searchActivation !== '', fn($q) => $q->where('activation', $this->searchActivation))
                ->orderBy($this->sortField, $this->sortDirection)
                ->paginate($this->perPage);