app/Livewire/OrgApp/Student/SetupMap.php

select count(*) as aggregate from `students` where `student_groups_id` in (1, 2, 3)
select * from `students` where `students`.`student_groups_id` in (1, 2, 3)
---
    public function render()
    {
        // Get late students grouped by group id
        $lateStudentsData = StudentRepo::studentsSurveyLate();
        $lateStudentsGroups = collect($lateStudentsData)->where('activation', 1)->groupBy('student_groups_id');

        // 1. Get active group IDs for today and their max_students sum
        $activeGroupsQuery = StudentGroup::activeToday();
        $activeGroupsData = $activeGroupsQuery->withCount([
            'students' => function ($query) {
                $query->where('activation', 1);
            },
            'students as withdrawn_count' => function ($query) {
                $query->where('activation', 0);
            },
            'teachers',
            'studentGroupSchedules as past_schedules_count' => function ($query) {
                $query->where('schedule_date', '<=', now()->format('Y-m-d'))
                    ->where('is_off_day', 0);
            },
            'dailyAttendances as present_count' => function ($query) {
                $query->where('status', 'present')
                    ->where('attendance_date', '<=', now()->format('Y-m-d'))
                    ->whereHas('student', function ($q) {
                        $q->where('activation', 1);
                    });
            },
            'dailyAttendances as absent_count' => function ($query) {
                $query->where('status', 'absent')
                    ->where('attendance_date', '<=', now()->format('Y-m-d'))
                    ->whereHas('student', function ($q) {
                        $q->where('activation', 1);
                    });
            },
            'dailyAttendances as today_present_count' => function ($query) {
                $query->where('status', 'present')
                    ->where('attendance_date', now()->format('Y-m-d'))
                    ->whereHas('student', function ($q) {
                        $q->where('activation', 1);
                    });
            },
            'dailyAttendances as today_absent_count' => function ($query) {
                $query->where('status', 'absent')
                    ->where('attendance_date', now()->format('Y-m-d'))
                    ->whereHas('student', function ($q) {
                        $q->where('activation', 1);
                    });
            }
        ])
            ->get()
            ->map(function ($group) use ($lateStudentsGroups) {

select count(*) as aggregate from `students` where `student_groups_id` in (1, 2, 3)
select `survey_for_section` from `survey_table`
select `id` from `statuses` where `id` in (120, 137, 138, 139, 140, 141, 142, 143, 144)
---



        $hasStudents = Student::whereIn('student_groups_id',  $activeGroupsIds)->count();
        $studentsPercentage = $totalMaxStudents > 0 ? (int) round(($hasStudents / $totalMaxStudents) * 100) : 0;

        // Get required survey sections from survey_table
        $surveyTableSectors = DB::table('survey_table')->pluck('survey_for_section')->unique()->toArray();
        $statusSectors = Status::whereIn('id', $surveyTableSectors);
        $statusSectorsIds = $statusSectors->pluck('id')->toArray();

select distinct `survey_for_section` from `survey_questions` where `batch_no` = 3 and `survey_for_section` in (120, 137, 138, 139, 140, 141, 142, 143, 144)
---
        $actualFoundPairsCount = 0;

        foreach ($uniqueBatches as $batch) {
            $addedInSectionForThisBatch = SurveyQuestion::where('batch_no', $batch)
                ->whereIn('survey_for_section', $statusSectorsIds)
                ->distinct('survey_for_section')
                ->pluck('survey_for_section')
                ->toArray();

select `status_name` from `statuses` where `id` in (139, 140, 143, 144)
---
        }

        $notAddedIds = array_unique($missingSectionIds);
        $sectorNotAddedNames = Status::whereIn('id', $notAddedIds)->pluck('status_name')->toArray();

select count(*) as count, min(from_percentage) as min_from, max(to_percentage) as max_to from `survey_grading_scale_tables` where `batch_no` = 3 and `survey_for_section` = 137 limit 1
---
        foreach ($uniqueBatches as $batch) {
            foreach ($filtered  as $sectionId) {

                $stats = DB::table('survey_grading_scale_tables')
                    ->where('batch_no', $batch)
                    ->where('survey_for_section', $sectionId)
                    ->selectRaw('count(*) as count, min(from_percentage) as min_from, max(to_percentage) as max_to')
                    ->first();

select `status_name` from `statuses` where `id` in (139, 140, 143, 144)
---
            }
        }

        $gradingScaleMissingNames = Status::whereIn('id', array_unique($gradingScaleMissingIds))->pluck('status_name')->toArray();

select `student_group_id` from `student_group_schedules` where `schedule_date` = '2026-04-10' and `student_group_id` in (1, 2, 3)
select count(*) as aggregate from `students` where `student_groups_id` in (1, 2, 3) and `activation` = 1 and `enrollment_type` in ('full_week')
select count(*) as aggregate from `student_daily_attendances` where `attendance_date` = '2026-04-10' and `student_group_id` in (1, 2, 3)
---
        }

        // المجموعات التي لها جدول اليوم
        $scheduledGroupIds = StudentGroupSchedule::where('schedule_date', today()->format('Y-m-d'))
            ->whereIn('student_group_id', $activeGroupsIds)
            ->pluck('student_group_id');

        // عدد الطلاب الذين يجب إدخال الحضور والغياب لهم اليوم
        $expectedAttendanceStudentsCount = Student::whereIn('student_groups_id', $scheduledGroupIds)
            ->where('activation', GlobalSystemConstant::ACTIVE)
            ->whereIn('enrollment_type', $enrollmentTypes)
            ->count();

        // عدد الطلاب الذين تم إدخال الحضور والغياب لهم بالفعل اليوم
        $enteredAttendanceStudentsCount = StudentDailyAttendance::where('attendance_date', today()->format('Y-m-d'))
            ->whereIn('student_group_id', $scheduledGroupIds)
            ->count();