app/Livewire/OrgApp/Student/Show.php

select * from `students` where `students`.`id` = '514' limit 1
---
public function mount($student)
{
    $user = auth()->user();

    // نستخدم الـ Scope للتأكد من أن المدرس له وصول لمجموعة هذا الطالب بالتحديد
    $this->studentData = Student::visibleToTeacher($user)->find($student);