app/Livewire/OrgApp/SurveyAnswers/Create.php

    public function filledSurveys()
    {
        if (!$this->account_id) {
            return [];
        }
        return SurveyAnswer::where('account_id', $this->account_id)
            ->pluck('survey_no')
            ->unique()
            ->toArray();
---
select `survey_no` from `survey_answers` where `account_id` = '442300315'

    public function student()
    {
        if (!$this->account_id) {
            return null;
        }
        return \App\Models\Student::where('identity_number', $this->account_id)->first();
---
select * from `students` where `identity_number` = '442300315' limit 1