app/Reposotries/ActivityBeneficiaryRepo.php

    public static function beneficiaries()
    {
        return Cache::rememberForever('Beneficiary-all', function () {
            return ActivityBeneficiary::get();
---
select * from `activity_beneficiaries`