app/Reposotries/ActivityRepo.php

select * from `activities` order by `created_at` desc
select * from `statuses` where `statuses`.`id` in (28)
---
    public static function activites()
    {
        return Cache::rememberForever('activites-all', function () {
            return Activity::with(['activityStatus', 'attachments'])->latest()->get();