app/Reposotries/CityRepo.php

    public static function cities()
    {
        return Cache::rememberForever('city-all', function () {
            return City::select('id', 'city_name', 'region_id')->get();
---
select `id`, `city_name`, `region_id` from `cities`