app/Reposotries/employeeRepo.php

    public static function employees()
    {
       return Cache::rememberForever('Employee-all', function () {
            return Employee::select('id', 'full_name', 'user_id', 'activation')->get();
---
select `id`, `full_name`, `user_id`, `activation` from `employees`