app/Reposotries/EventAssigneeRepo.php

select `id`, `event_id`, `employee_id`, `status`, `response` from `event_assignees` where `status` in ('pending', 'clarification_needed') and exists (select * from `employees` where `event_assignees`.`employee_id` = `employees`.`id` and `user_id` = 1)
---
    public static function eventAssignees($id = null)
    {
        $userId = auth()->id();
        return Cache::rememberForever("assignees.user_{$userId}.{$id}" , function () {
            return EventAssignee::with(['employee:id,user_id,full_name'])
            ->select('id', 'event_id', 'employee_id', 'status', 'response')
            ->whereIn('status', ['pending', 'clarification_needed'])
            ->whereHas('employee', function ($query) {
                $query->where('user_id', auth()->id());
            })
            ->get();