app/Reposotries/PartnersRepo.php

    public static function partners() {
     return   Cache::rememberForever('partners-all', function () {
        return PartnerInstitution::get();
---
select * from `partner_institutions`