app/Reposotries/PurchaseRequisitionRepo.php

    public static function purchases()
    {
        return Cache::rememberForever('PurchaseRequisition-all', function () {
            return PurchaseRequisition::get();
---
select * from `purchase_requisitions`