app/Reposotries/RegionRepo.php

    public static function regions()
    {
        return Cache::rememberForever('Region-all', function () {
            return Region::select('id', 'region_name')->get();
---
select `id`, `region_name` from `regions`