app/Reposotries/StatusRepo.php

select `id`, `status_name`, `p_id`, `p_id_sub`, `description` from `statuses`
---
    public static function statuses()
    {
        return Cache::rememberForever('statuses-all', function () {
            return Status::select('id', 'status_name', 'p_id', 'p_id_sub', 'description')->get();
        });