app/Reposotries/StudentRepo.php

select * from `students`
---
  public static function studentsNames()
  {
    $user = auth()->user();
    return Student::visibleToTeacher($user)->get();