app/Reposotries/StudentGroupRepo.php

    public static function studentGroups()
    {
        return Cache::rememberForever('StudentGroup-all', function () {
            return StudentGroup::select('id', 'name', 'batch_no')->get();
        });
---
select `id`, `name` from `student_groups`