app/Livewire/OrgApp/ActivitySector/Index.php

    public function activities()
    {
        if (!$this->selectedSectorId || !$this->selectedSectorDate) {
            return collect();
        }

        // Parse the m/Y date from the view/model
        try {
            $date = \Carbon\Carbon::createFromFormat('!m/Y', $this->selectedSectorDate);
            $month = $date->month;
            $year = $date->year;
        } catch (\Exception $e) {
            return collect();
        }

        return Activity::where('sector_id', $this->selectedSectorId)
            ->whereMonth('start_date', $month)
            ->whereYear('start_date', $year)
            ->with(['parcels', 'regions', 'activityStatus', 'cities', 'activityNeighbourhood', 'activityLocation'])
            ->latest('start_date')
            ->get();
---
select * from `activities` where `sector_id` = 30 and month(`start_date`) = '03' and year(`start_date`) = 2026 order by `start_date` desc