app/Livewire/OrgApp/Reports/EducationalProgress.php

    public function render()
    {
        if (Gate::denies('reports.educational.progress')) {
            abort(403, 'You do not have the necessary permissions.');
        }
        // 1. Base Query for Students
        $studentQuery = Student::query()
            ->where('activation', 1);

        if ($this->selectedRegion) {
            $studentQuery->where('region_id', $this->selectedRegion);
        }

        if ($this->selectedGroup) {
            $studentQuery->where('student_groups_id', $this->selectedGroup);
        }

        $students = $studentQuery->with(['studentGroup', 'region'])->get();

        // 2. Base Query for Groups (to filter charts if needed and calculate total capacity)
        $groupQuery = StudentGroup::query()->where('activation', 1);
        if ($this->selectedRegion) {
            $groupQuery->where('region_id', $this->selectedRegion);
        }
        if ($this->selectedGroup) {
            $groupQuery->where('id', $this->selectedGroup);
        }
        $groups = $groupQuery->get();
---
select * from `student_groups` where `student_groups`.`id` in (1, 2, 3)
select * from `students` where `activation` = 1
select * from `student_groups` where `activation` = 1


        return view('livewire.org-app.reports.educational-progress', [
            'regions' => Region::all(),
            'studentGroups' => StudentGroup::where('activation', 1)->get(),
---
select * from `student_groups` where `activation` = 1