app/Livewire/OrgApp/Reports/GroupsAttendance.php

    public function render()
    {
        $groups = StudentGroup::with(['region', 'city', 'neighbourhood', 'location'])
            ->get()
            ->map(function ($group) {
                // Calculate attendance within the date range
                $attendanceQuery = StudentDailyAttendance::where('student_group_id', $group->id);

                if ($this->dateFrom) {
                    $attendanceQuery->whereDate('attendance_date', '>=', $this->dateFrom);
                }
                if ($this->dateTo) {
                    $attendanceQuery->whereDate('attendance_date', '<=', $this->dateTo);
                }

                $attendances = $attendanceQuery->get();

                return [
                    'name' => $group->name,
                    'region' => $group->region?->region_name ?? '-',
                    'city' => $group->city?->city_name ?? '-',
                    'neighbourhood' => $group->neighbourhood?->neighbourhood_name ?? '-',
                    'present_count' => $attendances->where('status', 'present')->count(),
                    'absent_count' => $attendances->where('status', 'absent')->count(),
                ];
---
select * from `cities` where `cities`.`id` in (402, 405, 406)
select * from `regions` where `regions`.`id` in (4)
select * from `student_groups`
select * from `student_daily_attendances` where `student_group_id` = 1 and date(`attendance_date`) >= '2023-10-30' and date(`attendance_date`) <= '2026-04-10'