app/Livewire/OrgApp/SurveyQuestions/GradingScale/Index.php

    public function gradingScales()
    {
        return SurveyGradingScaleTable::query()->with('typeRel', 'surveyForSection' )
            ->when($this->searchBatch, function ($query) {
                $query->where('batch_no', $this->searchBatch);
            })
            ->when($this->searchSection, function ($query) {
                $query->where('survey_for_section', $this->searchSection);
            })
            ->where(function ($query) {
                $query->where('evaluation', 'like', '%' . $this->search . '%')
                    ->orWhere('description', 'like', '%' . $this->search . '%');
            })
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);
---
select * from `survey_grading_scale_tables` where `survey_for_section` = '137' and (`evaluation` like '%%' or `description` like '%%') order by `id` desc limit 10 offset 0
select count(*) as aggregate from `survey_grading_scale_tables` where `survey_for_section` = '137' and (`evaluation` like '%%' or `description` like '%%')

    public function render()
    {
        if (Gate::denies('survey.grading.scale.index'))
        {
            abort(403, __('You do not have the necessary permissions.'));
        }

        $batches = \App\Models\StudentGroup::select('batch_no')->distinct()->whereNotNull('batch_no')->orderBy('batch_no')->get();
---
select distinct `batch_no` from `student_groups` where `batch_no` is not null order by `batch_no` asc