app/Livewire/AppSetting/Ability/Create.php

select * from `module_names`
---
    public function ModuleNames(): Collection {
        return ModuleName::get();