app/Livewire/AppSetting/Ability/Index.php

    public function abilities(): LengthAwarePaginator
    {
        return Ability::with(['module_name'])
            ->SearchName($this->search)
            ->searchModuleId($this->searchModuleName)
            ->paginate($this->perPage);
---
select * from `abilities` limit 30 offset 0
select * from `module_names` where `module_names`.`id` in (1, 2, 3, 4, 5, 6, 8)
select count(*) as aggregate from `abilities`

    public function ModuleNames(): Collection
    {
        return ModuleName::get();
---
select * from `module_names`