app/Livewire/OrgApp/Activity/Index.php

select * from `statuses` where `statuses`.`id` in (28)
---
    public function activities()
    {
        return Activity::with(['regions', 'cities', 'activityStatus', 'statusSpecificSector', 'attachments'])
            ->withCount('attachments')
            ->when($this->search, fn($q) => $q->where('name', 'like', '%' . $this->search . '%'))
            ->when($this->start_date, fn($q) => $q->where('start_date', $this->start_date))
            ->when($this->status_id, function ($q) {
                $today = now()->toDateString();

                // Merged logic: Filter for rows with this status ID OR rows with NULL status that logically match it
                $q->where(function ($query) use ($today) {
                    $query->where('status', $this->status_id);

                    $query->orWhere(function ($subQuery) use ($today) {
                        $subQuery->whereNull('status');
                        match ((int) $this->status_id) {
                            27 => $subQuery->whereHas('attachments'), // Completed
                            25 => $subQuery->whereDoesntHave('attachments')->where('start_date', '>', $today), // Planned
                            26 => $subQuery->whereDoesntHave('attachments')
                                ->where(function($q) use ($today) {
                                    $q->where('start_date', $today)
                                      ->orWhere(function($sq) use ($today) {
                                          $sq->where('start_date', '<', $today)
                                            ->where('end_date', '>', $today);
                                      });
                                }), // In Progress
                            28 => $subQuery->whereDoesntHave('attachments')
                                ->where(function($q) use ($today) {
                                    $q->where(function($sq) use ($today) {
                                        $sq->where('start_date', '<', $today)
                                          ->where(function($esq) use ($today) {
                                              $esq->where('end_date', '<=', $today)
                                                ->orWhereNull('end_date');
                                          });
                                    })->orWhereNull('start_date');
                                }), // Need Procedure / On Hold
                            default => $subQuery->whereRaw('1=0'), // No match for other IDs
                        };
                    });
                });
            })
            ->when($this->region_id, fn($q) => $q->where('region', $this->region_id))
            ->when($this->city_id, fn($q) => $q->where('city', $this->city_id))
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate(10);