app/Livewire/OrgApp/Activity/Index.php

select * from `activity_attchments` where `activity_attchments`.`activity_id` in (91, 92, 93)
---
    public function deleteAttachment($id)
    {
        if(Gate::denies('activity.create')){
            return abort(403,'You do not have the necessary permissions');
        }
        $attachment = ActivityAttchment::find($id);