app/Livewire/OrgApp/Activity/Show.php

select * from `activity_work_teams` where `activity_work_teams`.`activity_id` in (47)
select * from `statuses` where `statuses`.`id` in (55)
---
    public function mount(Activity $activity)
    {
        $this->activity = $activity->load(['regions', 'cities', 'activityNeighbourhood', 'activityLocation', 'activityStatus', 'statusSpecificSector', 'creator','parcels.purchaseRequisition', 'beneficiaries', 'workTeams', 'summary']);