app/Livewire/OrgApp/StudentGroups/DailyStudents.php

select * from `student_daily_attendances` where `student_group_id` = 1 and `attendance_date` = '2026-04-05'
---
    public function mount(StudentGroup $group, $date)
    {
        $this->group = $group;
        $this->date = $date;
        $carbonDate = Carbon::parse($date);
        $this->formattedDate = $carbonDate->format('F j, Y');
        $this->dayName = $carbonDate->format('D'); // Mon, Tue, etc.

        // Load existing attendance
        $existingAttendance = StudentDailyAttendance::where('student_group_id', $this->group->id)
            ->where('attendance_date', $this->date)
            ->get()
            ->keyBy('student_id');

select `students`.`id`, `full_name`, `identity_number`, `enrollment_type`, `students`.`activation` from `students` where `students`.`student_groups_id` = 1 and `students`.`student_groups_id` is not null and `enrollment_type` in ('full_week', 'sat_mon_wed')
---
    private function getStudents()
    {
        // Check if date is within group start/end dates
        $currentDate = Carbon::parse($this->date)->startOfDay();
        $groupStart = $this->group->start_date ? Carbon::parse($this->group->start_date)->startOfDay() : null;
        $groupEnd = $this->group->end_date ? Carbon::parse($this->group->end_date)->startOfDay() : null;

        if (($groupStart && $currentDate->lt($groupStart)) ||
            ($groupEnd && $currentDate->gt($groupEnd))) {
            return collect([]);
        }

        // Determine enrollment types to include based on day of week
        $enrollmentTypes = ['full_week'];
        $dayOfWeek = Carbon::parse($this->date)->dayOfWeek; // 0=Sun, 1=Mon, ..., 6=Sat

        if ($dayOfWeek === 6) { $enrollmentTypes[] = 'sat_mon_wed'; } // Saturday
        if ($dayOfWeek === 0) { $enrollmentTypes[] = 'sun_tue_thu'; } // Sunday
        if ($dayOfWeek === 1) { $enrollmentTypes[] = 'sat_mon_wed'; } // Monday
        if ($dayOfWeek === 2) { $enrollmentTypes[] = 'sun_tue_thu'; } // tuesday
        if ($dayOfWeek === 3) { $enrollmentTypes[] = 'sat_mon_wed'; } // Wednesday
        if ($dayOfWeek === 4) { $enrollmentTypes[] = 'sun_tue_thu'; } // Thursday

        return $this->group->students()
            ->select('students.id', 'full_name', 'identity_number', 'enrollment_type', 'students.activation', 'students.status_id')
            ->with('status:id,status_name')
            ->whereIn('enrollment_type', $enrollmentTypes)
            ->get();

insert into `student_daily_attendances` (`student_id`, `student_group_id`, `attendance_date`, `status`, `updated_by`, `updated_at`, `created_at`) values (112, 1, '2026-04-01', 'present', 1, '2026-04-10 16:30:58', '2026-04-10 16:30:58')
select * from `student_daily_attendances` where (`student_id` = 112 and `student_group_id` = 1 and `attendance_date` = '2026-04-01') limit 1
---
    public function saveAttendance()
    {
        $students = $this->getStudents();

        foreach ($students as $student) {
            $isPresent = $this->attendance[$student->id] ?? false;
            $status = $isPresent ? 'present' : 'absent';

            StudentDailyAttendance::updateOrCreate(
                [
                    'student_id' => $student->id,
                    'student_group_id' => $this->group->id,
                    'attendance_date' => $this->date,
                ],
                [
                    'status' => $status,
                    'updated_by' => auth()->id() ?? null, // Assuming auth
                ]
            );