app/Livewire/OrgApp/StudentGroups/Index.php

    public function groups()
    {
     return  StudentGroup::query()
            ->with(['region', 'city', 'status','partner'])  ->withCount(['students' => function ($query) {
    $query->where('activation', 1);
}])
            ->where(function ($query) {
                $query->where('name', 'like', '%' . $this->search . '%')
                      ->orWhere('Moderator', 'like', '%' . $this->search . '%')
                      ->orWhere('batch_no', 'like', '%' . $this->search . '%');
            })
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);
---
select `student_groups`.*, (select count(*) from `students` where `student_groups`.`id` = `students`.`student_groups_id` and `activation` = 1) as `students_count` from `student_groups` where (`name` like '%%' or `Moderator` like '%%' or `batch_no` like '%%') order by `created_at` desc limit 10 offset 0
select * from `cities` where `cities`.`id` in (402, 405, 406)
select * from `regions` where `regions`.`id` in (4)
select count(*) as aggregate from `student_groups` where (`name` like '%%' or `Moderator` like '%%' or `batch_no` like '%%')

    public function render()
    {
        if (Gate::denies('student.group.index'))
        {
            abort(403, 'You do not have the necessary permissions');
        }
        //          $data = Student::groupBy('student_groups_id')->select('student_groups_id', DB::raw('count(*) as total'))->get();

        // dd($data);
        return view('livewire.org-app.student-groups.index', [
            'subjectsMap' => StudentSubjectForLearn::all()->keyBy('id')
        ]);
---
select * from `student_subject_for_learns`