app/Livewire/OrgApp/StudentGroups/ShowSchedule.php

    public function mount(StudentGroup $group)
    {
        $this->group = $group;

        // Read dates raw from DB to bypass Eloquent cast interference
        // (StudentGroup has start_time/end_time cast as datetime:H:i which corrupts date parsing)
        $rawGroup = DB::table('student_groups')
            ->where('id', $group->id)
            ->select('start_date', 'end_date')
            ->first();
---
select `start_date`, `end_date` from `student_groups` where `id` = 3 limit 1

    public function render()
    {
        if (Gate::denies('student.group.schedule')) {
            abort(403, 'You do not have the necessary permissions');
        }
        // Parse the single Y-m string into a Carbon date
        $startOfMonth = Carbon::createFromFormat('Y-m', $this->currentYearMonth)->startOfMonth();
        $endOfMonth   = $startOfMonth->copy()->endOfMonth();
        $daysInMonth  = $startOfMonth->daysInMonth;

        // Fetch schedules using LIKE for reliability (whereYear/whereMonth fail on string-stored dates)
        $schedules = $this->group->studentGroupSchedules()
            ->where('schedule_date', 'like', $this->currentYearMonth . '-%')
            ->get()
            ->keyBy(fn($item) => Carbon::parse($item->schedule_date)->format('Y-m-d'));

        // Student counts by enrollment type
        $studentCounts = $this->group->students()
            ->selectRaw('enrollment_type, count(*) as count')
            ->groupBy('enrollment_type')
            ->pluck('count', 'enrollment_type')
            ->toArray();
---
select * from `student_group_schedules` where `student_group_schedules`.`student_group_id` = 3 and `student_group_schedules`.`student_group_id` is not null and `schedule_date` like '2026-04-%'
select enrollment_type, count(*) as count from `students` where `students`.`student_groups_id` = 3 and `students`.`student_groups_id` is not null group by `enrollment_type`