app/Livewire/AppSetting/Status/Index.php

    public function getStatuses(): LengthAwarePaginator
    {
        return Status::query()
            ->with(['status_p_id_sub', 'systemname'])
            ->searchName($this->search)
            ->searchpId($this->searchParentStatus)
            ->searchSystemName($this->searchSystemName)

            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);
---
select * from `statuses` where `p_id_sub` = '119' order by `created_at` desc limit 10 offset 0
select * from `system_names` where `system_names`.`id` in (1)
select count(*) as aggregate from `statuses` where `p_id_sub` = '119'

    public function getParentStatuses()
    {
        return Status::whereNull('p_id_sub')
            ->orWhere('p_id_sub', 0)
            ->orderBy('status_name')
            ->get();
---
select * from `statuses` where `p_id_sub` is null or `p_id_sub` = 29 order by `status_name` asc

    public function getSystemNames()
    {
        return SystemNames::orderBy('system_name')->get();
---
select * from `system_names` order by `system_name` asc