app/Livewire/OrgApp/Department/Index.php

    public function departments()
    {
        return Department::where('name', 'like', '%' . $this->search . '%')
            ->orWhere('location', 'like', '%' . $this->search . '%')
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate(10);
---
select * from `departments` where `name` like '%%' or `location` like '%%' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `departments` where `name` like '%%' or `location` like '%%'