app/Models/Activity.php

    public function getAverageRatingAttribute()
    {
        return $this->feedbacks()->avg('rating') ?? 0;
---
select avg(`rating`) as aggregate from `feed_backs` where `feed_backs`.`activity_id` = 42 and `feed_backs`.`activity_id` is not null