app/Models/StudentGroup.php

select * from `student_subject_for_learns` where `id` in (1)
---
    public function getSubjectsAttribute()
    {
        $ids = $this->subject_to_learn_id ?? [];
        if (empty($ids)) {
            return collect();
        }
        return StudentSubjectForLearn::whereIn('id', $ids)->get();