app/Models/Student.php

select * from `student_groups` where `id` = 1 limit 1
---
    public function getStudentAgeWhenJoinAttribute(): int
    {

        $birthDate = $this->birth_date;
        $joinDate = StudentGroup::where('id', $this->student_groups_id)->first()->start_date ?? null;