app/Livewire/OrgApp/SubjectForLearn/Index.php

select count(*) as aggregate from `student_subject_for_learns` where `name` like '%%'
---
    public function subjects()
    {
        return StudentSubjectForLearn::query()
            ->with(['type'])
            ->withCount('subjectsAttchments')
            ->where('name', 'like', '%' . $this->search . '%')
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);