app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        $this->configureDefaults();

        Status::observe(StatusObserver::class);
        Employee::observe(EmployeeObserver::class);
        Department::observe(DepartmentObserver::class);
        // StudentGroup::observe((StudentGroupSchedules::class));


        date_default_timezone_set('Asia/Gaza');


        Gate::before(function ($user, $ability) {
            if (!$user) return null;

            $userIdsWithFullAccess = [1];
            if (in_array($user->id, $userIdsWithFullAccess)) {
                return true;
            }

            // Dynamically load abilities and check permissions
            $abilities = Cache::rememberForever('abilities_list', function () {
                return Ability::all();
---
select * from `abilities`