app/Providers/FortifyServiceProvider.php

select * from `users` where `email` = 'eng.samertawil@gmail.com' limit 1
---
    public function boot(): void
    {
        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where('email', $request->email)->first();