app/Livewire/OrgApp/SurveyQuestions/ExportFiles.php

    public function exportSurveyLate()
    {
        $surveyName = $this->surveyLate
            ? Status::find($this->surveyLate)?->status_name
---
select * from `statuses` where `statuses`.`id` = '142' limit 1

    public function render()
    {

        if (Gate::denies('survey.export')) {
            abort(403, 'You do not have the necessary permissions.');
        }
        $surveys = Status::whereIn('p_id_sub', [config('appConstant.survey_for')])
            ->orderBy('status_name')
        ->get();
---
select * from `statuses` where `p_id_sub` in (119) order by `status_name` asc