app/Livewire/OrgApp/SurveyQuestions/Manage.php

select * from `survey_questions` where `survey_for_section` = '141' and `batch_no` = '3' order by `question_order` asc
---
    public function loadQuestions()
    {
        $this->resetValidation();

        if ($this->surveyForSection) {
            $this->questions = SurveyQuestion::where('survey_for_section', $this->surveyForSection)
                ->orderBy('question_order')
                ->get()
                ->map(function ($q) {
                    $qArray = $q->toArray();
                    $qArray['require_detail'] = (bool) $q->require_detail;
                    $qArray['answer_options'] = is_array($q->answer_options) ? $q->answer_options : [];
                    return $qArray;
                })
                ->toArray();