app/Livewire/OrgApp/Dashboard/Index.php

select * from `statuses` where `statuses`.`id` in (30, 55, 67)
select `sector_id`, count(*) as total from `activities` group by `sector_id`
---
    public function activities() {
        if (!Gate::allows('activity.index')) {
            return collect();
        }

        $activitiesBySector =

        Activity::select('sector_id', DB::raw('count(*) as total'))
        ->with('statusSpecificSector')
        ->groupBy('sector_id')
        ->get()
        ->map(function ($item) {
            return [
                'label' => $item->statusSpecificSector->status_name ?? 'Unknown',
                'value' => $item->total,
            ];
        });